local 梦女 = VG:创建人物('梦女')

return function()
    VG:显示背景('图片/背景/教室背景.png')
    梦女:说('测试开始')

    VG:显示背景('图片/背景/走廊背景1.png'):随着('向下滚动 1.0'):转场('溶解 2.0')
    梦女:说('当前测试：溶解转场以及向下滚动')

   -- 当前测试：黑屏渐变转场
	VG:转场命令('屏幕','淡出 1.0')
	VG:转场命令('屏幕','淡入 1.0')
    VG:显示背景('图片/背景/走廊背景2.png')
    VG:等待(2.0)
    梦女:说('当前测试：黑屏渐变转场')

    VG:显示背景('图片/背景/走廊背景2.png'):随着('向左滚动 1.0')
    梦女:说('当前测试：向左滚动')

    VG:显示背景('图片/背景/走廊背景1.png'):随着('向右滚动 1.0')
    梦女:说('当前测试：向右滚动')

    VG:显示背景('图片/背景/走廊背景2.png'):随着('向上滚动 1.0')
    梦女:说('当前测试：向上滚动')

    return
end