local 梦女 = 引擎:创建人物('梦女')

return function()
    引擎:显示背景('图片/背景/教室背景.png')
    梦女:说('测试开始')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_BLTR.png','2.0')
    引擎:显示背景('图片/背景/走廊背景1.png')
    梦女:说('当前转场测试：图片/转场/WIP_BLTR')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_BRTL.png','2.0')
    引擎:显示背景('图片/背景/学校操场.png')
    梦女:说('当前转场测试：图片/转场/WIP_BLTR')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_BT.png','2.0')
    引擎:显示背景('图片/背景/走廊背景2.png')
    梦女:说('当前转场测试：图片/转场/WIP_BT')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_LR.png','2.0')
    引擎:显示背景('图片/背景/教室背景.png')
    梦女:说('当前转场测试：图片/转场/WIP_LR')


    引擎:自定义图片转场命令('背景','图片/转场/WIP_MOZBT.png','2.0')
    引擎:显示背景('图片/背景/走廊背景1.png')
    梦女:说('当前转场测试：图片/转场/WIP_MOZBT')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_MOZH.png','2.0')
    引擎:显示背景('图片/背景/学校操场.png')
    梦女:说('当前转场测试：图片/转场/WIP_MOZH')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_MOZLR.png','2.0')
    引擎:显示背景('图片/背景/走廊背景2.png')
    梦女:说('当前转场测试：图片/转场/WIP_MOZLR')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_MOZRL.png','2.0')
    引擎:显示背景('图片/背景/教室背景.png')
    梦女:说('当前转场测试：图片/转场/WIP_MOZRL')


    引擎:自定义图片转场命令('背景','图片/转场/WIP_MOZTB.png','2.0')
    引擎:显示背景('图片/背景/走廊背景1.png')
    梦女:说('当前转场测试：图片/转场/WIP_MOZTB')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_MOZV.png','2.0')
    引擎:显示背景('图片/背景/学校操场.png')
    梦女:说('当前转场测试：图片/转场/WIP_MOZV')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_RL.png','2.0')
    引擎:显示背景('图片/背景/走廊背景2.png')
    梦女:说('当前转场测试：图片/转场/WIP_RL')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_TB.png','2.0')
    引擎:显示背景('图片/背景/教室背景.png')
    梦女:说('当前转场测试：图片/转场/WIP_TB')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_TLBR.png','2.0')
    引擎:显示背景('图片/背景/走廊背景1.png')
    梦女:说('当前转场测试：图片/转场/WIP_TLBR')

    引擎:自定义图片转场命令('背景','图片/转场/WIP_TRBL.png','2.0')
    引擎:显示背景('图片/背景/学校操场.png')
    梦女:说('当前转场测试：图片/转场/WIP_TRBL')
    return
end